In [1]:
import pandas as pd

In [3]:
df = {
    "tid":[1,2,3,4,5,6,7,8,9,10],
    "refund":["yes","no","no","yes","no","no","yes","no","no","yes"],
    "married_status" : ["married","single","divorce","single","divorce","married","married","single","married","divorce"],
    "income" : ["100k","130k","130k","120k","110k","105k","127k","130k","10k","135k"],
    "cheat" :["yes","no","yes","yes","no","yes","no","no","no","yes"]
}
df = pd.DataFrame(df)

In [4]:
df

   tid refund married_status income cheat
0    1    yes        married   100k   yes
1    2     no         single   130k    no
2    3     no        divorce   130k   yes
3    4    yes         single   120k   yes
4    5     no        divorce   110k    no
5    6     no        married   105k   yes
6    7    yes        married   127k    no
7    8     no         single   130k    no
8    9     no        married    10k    no
9   10    yes        divorce   135k   yes

In [12]:
df.iloc[4]

tid                     5
refund                 no
married_status    divorce
income               110k
cheat                  no
Name: 4, dtype: object

In [13]:
df.iloc[6]

tid                     7
refund                yes
married_status    married
income               127k
cheat                  no
Name: 6, dtype: object

In [14]:
df.iloc[8]

tid                     9
refund                 no
married_status    married
income                10k
cheat                  no
Name: 8, dtype: object

In [25]:
df.iloc[[0,4,7,8]]

   tid refund married_status income cheat
0    1    yes        married   100k   yes
4    5     no        divorce   110k    no
7    8     no         single   130k    no
8    9     no        married    10k    no

In [27]:
nominal = pd.Series(['HR','IT','Sales','Finance'])
binary = pd.Series([1,0,1,0])
ordinal = pd.Categorical(['Low','Medium','High','Low'], ordered=True, categories=['Low','Medium','High'])
numeric = pd.Series([10,20,30,40])
nominal, binary, ordinal, numeric

(0         HR
 1         IT
 2      Sales
 3    Finance
 dtype: object,
 0    1
 1    0
 2    1
 3    0
 dtype: int64,
 ['Low', 'Medium', 'High', 'Low']
 Categories (3, object): ['Low' < 'Medium' < 'High'],
 0    10
 1    20
 2    30
 3    40
 dtype: int64)

In [28]:
df.iloc[3:8]

   tid refund married_status income cheat
3    4    yes         single   120k   yes
4    5     no        divorce   110k    no
5    6     no        married   105k   yes
6    7    yes        married   127k    no
7    8     no         single   130k    no

In [29]:
df.iloc[4:9,2:5]

  married_status income cheat
4        divorce   110k    no
5        married   105k   yes
6        married   127k    no
7         single   130k    no
8        married    10k    no

In [33]:
df.iloc[:,1:4]

  refund married_status income
0    yes        married   100k
1     no         single   130k
2     no        divorce   130k
3    yes         single   120k
4     no        divorce   110k
5     no        married   105k
6    yes        married   127k
7     no         single   130k
8     no        married    10k
9    yes        divorce   135k

In [47]:
# Install dependencies as needed:
# pip install kagglehub[pandas-datasets]
import kagglehub
from kagglehub import KaggleDatasetAdapter

# Set the path to the file you'd like to load
file_path = "Iris.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "uciml/iris",
  file_path,
  # Provide any additional arguments like 
  # sql_query or pandas_kwargs. See the 
  # documenation for more information:
  # https://github.com/Kaggle/kagglehub/blob/main/README.md#kaggledatasetadapterpandas
)

print("First 5 records:", df.head())

C:\Users\Yamini Ahuja\AppData\Local\Temp\ipykernel_4756\1921488342.py:10: DeprecationWarning: load_dataset is deprecated and will be removed in a future version.
  df = kagglehub.load_dataset(

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.12), please consider upgrading to the latest version (0.3.13).
First 5 records:    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [48]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [49]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [58]:
df.drop(index=4).drop(df.columns[3], axis=1)

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

In [59]:
data = {
    'Employee_ID':[101,102,103,104,105],
    'Name':['Alice','Bob','Charlie','Diana','Edward'],
    'Department':['HR','IT','IT','Marketing','Sales'],
    'Age':[29,34,41,28,38],
    'Salary':[50000,70000,65000,55000,60000],
    'Years_of_Experience':[4,8,10,3,12],
    'Joining_Date':['2020-03-15','2017-07-19','2013-06-01','2021-02-10','2010-11-25'],
    'Gender':['Female','Male','Male','Female','Male'],
    'Bonus':[5000,7000,6000,4500,5000],
    'Rating':[4.5,4.0,3.8,4.7,3.5]
}

emp = pd.DataFrame(data)

In [71]:
emp.shape

(5, 10)

In [72]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

In [73]:
emp.describe()

,Employee_ID,Age,Salary,Years_of_Experience,Bonus,Rating
count,5.000000,5.000000,5.00000,5.000000,5.0,5.000000
mean,103.000000,34.000000,60000.00000,7.400000,5500.0,4.100000
std,1.581139,5.612486,7905.69415,3.847077,1000.0,0.494975
min,101.000000,28.000000,50000.00000,3.000000,4500.0,3.500000
25%,102.000000,29.000000,55000.00000,4.000000,5000.0,3.800000
50%,103.000000,34.000000,60000.00000,8.000000,5000.0,4.000000
75%,104.000000,38.000000,65000.00000,10.000000,6000.0,4.500000
max,105.000000,41.000000,70000.00000,12.000000,7000.0,4.700000

In [66]:
emp.head()

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5

In [67]:
emp.tail(3)

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5

In [76]:
emp['Salary'].mean()

np.float64(60000.0)

In [77]:
emp['Bonus'].sum()

np.int64(27500)

In [78]:
emp['Age'].min()

np.int64(28)

In [79]:
emp['Rating'].max()

np.float64(4.7)

In [81]:
emp.sort_values('Salary',ascending = False)

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5

In [82]:
emp.isnull().sum()

Employee_ID            0
Name                   0
Department             0
Age                    0
Salary                 0
Years_of_Experience    0
Joining_Date           0
Gender                 0
Bonus                  0
Rating                 0
dtype: int64

In [83]:
emp = emp.rename(columns={'Employee_ID':'ID'})

In [84]:
emp

,ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5